#### Terraform Plan Output in app-infras/environment/todo-app
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.todo_tasks will be created
  + resource "aws_dynamodb_table" "todo_tasks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "todo-tasks"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_iam_role_policy.lambda_dynamodb_policy will be created
  + resource "aws_iam_role_policy" "lambda_dynamodb_policy" {
      + id          = (known after apply)
      + name        = "lambda-dynamodb-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "lambda-exec-role-todo-app"
    }

  # aws_lambda_function.todo_app will be updated in-place
  ~ resource "aws_lambda_function" "todo_app" {
        id                             = "todo-app"
      ~ last_modified                  = "2024-10-14T08:18:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "X6iGceOIR5yRQlDtgPrjJGa+vc3ShRvQSNDles4RAFQ=" -> "xN15+TM7hlPYJ5edJtWVWIDsr4RFoZlxipBxejP2Qhw="
        tags                           = {}
        # (27 unchanged attributes hidden)

      + environment {
          + variables = {
              + "DYNAMODB_TABLE" = "todo-tasks"
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```